Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Sources do not correspond to code being executed
zh_cn: 源代码不对应于正在执行的代码

source: Space
zh_cn: 空格

source: Space at the end means the end of a pattern, and the preceding string will be considered not just a prefix but a whole pattern.
zh_cn: 结束处的空格表示模式的结尾，并且前一个字符串将被认为不仅仅是前缀，而是整个模式。

source: Spaces
zh_cn: 空格

source: Special 'else if' treatment
zh_cn: 特殊的 'else if' 处理

source: Specified by:
zh_cn: 指定者:

source: Specify Analysis Scope
zh_cn: 指定分析范围

source: Specify Documentation &URL...
zh_cn: 指定文档网址...(&U)

source: Specify Documentation URL
zh_cn: 指定文档 URL

source: Specify Search Criteria
zh_cn: 指定搜索条件

source: Specify URL...
zh_cn: 指定 URL...

source: Specify artifact &name:
zh_cn: 指定 artifact 名:(&N)

source: Specify default value to be used in all existing calls of this method.
zh_cn: 指定在此方法的所有现有调用中使用的默认值。

source: Specify group name the {0} will be shown under.
zh_cn: 指定组名称 {0} 将显示在下面。

source: Specify name of {0} subgroup the {1} will be shown under.
zh_cn: 指定 {0} 子组的名称 {1} 将显示在其下面。

source: Specify one guide (80) or several (80, 120)
zh_cn: 指定一个 (80) 或几个 (80, 120) 指导

source: Specify prefix for names of {0} selected modules:
zh_cn: 为所选 {0} 模块的名称指定前缀：

source: Specify the SDK at Project Structure dialog.
zh_cn: 在项目结构对话框中指定 SDK 。

source: Specify the SDK in the Project Structure dialog.
zh_cn: 在项目结构对话框中指定 SDK 。

source: Specify the output path in Configure Project.
zh_cn: 在配置项目中指定输出路径。

source: Specify the output path in the Project Structure dialog.
zh_cn: 在项目结构对话框中指定输出路径。

source: Specify type for exception
zh_cn: 为异常指定类型

source: Specify {0} Scope
zh_cn: 指定 {0} 范围

source: Specify {0} type for parameter ''{1}''
zh_cn: 指定 {0} 类型给参数 ''{1}''

source: Speed search in trees
zh_cn: 在树列表快速搜索

source: Speed up HTML, XML or CSS development with Emmet.
zh_cn: 使用 Emmet 加速 HTML ， XML 或 CSS 的开发。

source: Split Declaration
zh_cn: 拆分声明

source: Split Hori_zontally
zh_cn: 水平拆分(_Z)

source: Split If
zh_cn: 拆分 If

source: Split Line
zh_cn: 拆分行

source: Split Mode
zh_cn: 拆分模式

source: Split _Horizontally
zh_cn: 水平拆分(_H)

source: Split _Vertically
zh_cn: 垂直拆分(_V)

source: Split current tag
zh_cn: 拆分当前标签

source: Split editor area into 2 tab groups and move the current tab to the bottom group
zh_cn: 拆分编辑器区域为2个选项卡组，并移动当前选项卡到底部组

source: Split editor area into 2 tab groups and move the current tab to the bottom group and close the top editor
zh_cn: 拆分编辑器区域为2个选项卡组，并移动当前选项卡到底部组，并关闭上边组

source: Split editor area into 2 tab groups and move the current tab to the right group
zh_cn: 拆分编辑器区域为2个选项卡组，并移动当前选项卡到右边组

source: Split editor area into 2 tab groups and move the current tab to the right group and close the left editor
zh_cn: 拆分编辑器区域为2个选项卡组，并移动当前选项卡到右边组，并关闭左边组

source: Split filter
zh_cn: 拆分过滤器

source: Split into 2 if's
zh_cn: 拆分为2个 If

source: Split into declaration and assignment
zh_cn: 拆分为声明和赋值

source: Split into filter chain
zh_cn: 拆分为过滤器链

source: Split into filter's chain
zh_cn: 拆分为过滤器链

source: Split into separate declarations
zh_cn: 拆分为分开的声明

source: Stac&ktrace
zh_cn: 堆栈跟踪(&K)

source: Stack frame unavailable
zh_cn: 堆栈帧不可用

source: Standard Macro Actions
zh_cn: 标准宏操作

source: Start CPU Usage Profiling
zh_cn: 启动 CPU 使用情况分析

source: Start New Line
zh_cn: 开始新行

source: Start New Line Before Current
zh_cn: 在当前位置之前开始新行

source: Start _Macro Recording
zh_cn: 开始录制宏(_M)

source: Start editing code in the specified directory
zh_cn: 开始编辑指定目录中的代码

source: Start editing code in the specified file or directory.
zh_cn: 开始在指定的文件或目录中编辑代码。

source: Start incremental search (searches string as you type), IntelliJ IDEA 6.0 implementation.
zh_cn: 启动增量搜索(搜索字符串时输入)，IntelliJ IDEA 6.0实现。

source: Start index is less than 0
zh_cn: 开始索引小于0

source: Start tag has wrong closing tag
zh_cn: 开始标签有错误的关闭标签

source: Start tag:\&nbsp;could be omitted
zh_cn: 开始标签:\&nbsp;可以省略

source: Start the "New Project" Wizard that will guide you through the steps necessary for creating a new project.
zh_cn: 启动 "新项目" 向导，它将引导你创建一个新的项目或者导入一个已存在的项目。

source: Start the build before generating module-info descriptors?
zh_cn: 在生成 module-info 描述符之前开始构建？

source: Start typing a method declaration or a statement, and press &shortcut:EditorChooseLookupItemCompleteStatement; after the opening parenthesis.
zh_cn: 开始输入方法申明或语句，然后在左括号后按 &shortcut:EditorChooseLookupItemCompleteStatement; 。

source: Start typing a regular expression, then press &shortcut:ShowIntentionActions; and choose Edit RegExp.
zh_cn: 开始输入一个正则表达式，然后按 &shortcut:ShowIntentionActions; 并选择 Edit RegExp。

source: Start typing the desired text, and the list of available templates will shrink to show matching templates only:
zh_cn: 开始输入所需的文本，可用的模板列表将缩小，仅显示匹配的模板：

source: Start typing to filter the list of members, and use Enter to navigate to the selected item.
zh_cn: 开始输入以过滤成员列表，然后使用 Enter 导航至所选项目。

source: Start typing, press &shortcut:CodeCompletion;, and select the desired string from the suggestion list.
zh_cn: 开始输入，按下 &shortcut:CodeCompletion; ，然后从建议列表中选择想要的字符串。

source: Start/Stop Macro _Recording
zh_cn: 启动/停止录制宏(_R)

source: Start/Stop recording of a new macro
zh_cn: 启动/停止录制一个新的宏

source: Started
zh_cn: 开始

source: Starting Ant Build
zh_cn: 开始 Ant 构建

source: Starting JVM...
zh_cn: 正在启动 JAVA 虚拟机...

source: Starting up {0} ...
zh_cn: 启动 {0} ...

source: Starting...
zh_cn: 开始...

source: Startup pa&ge:
zh_cn: 启动页面：(&G)

source: Startup/Connection
zh_cn: 启动/连接

source: Statement
zh_cn: 语句

source: Statement ''{0}'' not supported
zh_cn: 语句 ''{0}'' 不支持

source: Statement expected
zh_cn: 期望语句

source: Statement must be prepended with case label
zh_cn: 语句必须加上 case 标签

source: Statements to &evaluate:
zh_cn: 要计算的语句：(&E)

source: Static &final fields
zh_cn: 静态 final 字段(&F)

source: Static field of &type:
zh_cn: 静态字段类型：(&T)

source: Static field:
zh_cn: 静态字段：

source: Static fields
zh_cn: 静态字段

source: Static imports
zh_cn: 静态导入

source: Static inner classes
zh_cn: 静态内部类

source: Static interface method calls
zh_cn: 静态接口方法调用

source: Static member ''{0}.{1}'' accessed via instance reference
zh_cn: 静态成员 ''{0}.{1}'' 通过实例引用访问

source: Static member qualifying type may not be annotated
zh_cn: 静态成员限定类型可能不会被注释

source: Static method ''{0}'' in ''{1}'' cannot override instance method ''{2}'' in ''{3}''
zh_cn: ''{1}'' 中的静态方法 ''{0}'' 不能覆盖 ''{3}'' 中的实例方法 ''{2}''

source: Static method may be invoked on containing interface class only
zh_cn: 静态方法只能在包含接口的类上调用。

source: Static methods
zh_cn: 静态方法

source: Statistics
zh_cn: 统计

source: Status
zh_cn: 状态

source: Status of current settings, input errors, etc
zh_cn: 当前设置状态，输入错误等

source: Status:
zh_cn: 状态：

source: Step Ou_t
zh_cn: 步出(_T)

source: Step _Into
zh_cn: 步入(_I)

source: Step _Over
zh_cn: 步过(_O)

source: Step into the particular method
zh_cn: 步入特定的方法

source: Step into, ignore stepping filters for libraries, constructors, etc.
zh_cn: 步入，忽略库，构造器等的步进过滤器。

source: Step over, disable all breakpoints before stepping.
zh_cn: 步过，禁用所有断点。

source: Step to the first line executed after returning from this method
zh_cn: 步至从这个方法返回后执行的第一行

source: Step to the next line executed
zh_cn: 步入到已执行的下一行

source: Step to the next line in this file
zh_cn: 步至这个文件的下一行

source: Stepping
zh_cn: 步进

source: Stepping in thread {0} is blocked by thread {1}
zh_cn: 进行的线程 {0} 被线程 {1} 阻塞

source: Stepping into
zh_cn: 步入

source: Stepping out
zh_cn: 步出

source: Stepping over
zh_cn: 步过

source: Stop
zh_cn: 停止

source: Stop ''{0}''
zh_cn: 停止 ''{0}''

source: Stop All ({0})
zh_cn: 停止全部 ({0})

source: Stop Background Processes...
zh_cn: 停止后台进程...

source: Stop Background processes
zh_cn: 停止后台进程

source: Stop CPU Usage Profiling
zh_cn: 停止 CPU 使用情况分析

source: Stop Capturing Allocations
zh_cn: 停止捕获分配

source: Stop Searching
zh_cn: 停止搜索

source: Stop _Macro Recording
zh_cn: 停止录制宏(_M)

source: Stop and Rerun
zh_cn: 停止并重新运行

source: Stop background search
zh_cn: 停止后台搜索

source: Stop incompatible
zh_cn: 停止不兼容

source: Stop process
zh_cn: 停止进程

source: Stop selected configuration(s)
zh_cn: 停止所选配置

source: Stop selected run configuration(s)
zh_cn: 停止所选运行配置

source: Stop watching method return values
zh_cn: 停止观察方法返回值

source: Stopped
zh_cn: 停止

source: Stopped at cursor
zh_cn: 停止在光标位置

source: Stopping attempt to balance tags properly at this point
zh_cn: 此时停止尝试平衡标签

source: Store Current La_yout as Default
zh_cn: 将当前布局存储为默认布局(_Y)

source: Store current layout as default
zh_cn: 存储当前布局为默认布局

source: Stores elements of java.util.Collection into array
zh_cn: 将 java.util.Collection 的元素存储到数组中

source: Storing changes...
zh_cn: 存储更改...

source: Storing element of type <code>{0}</code> to array of <code>{1}</code> elements may produce <code>java.lang.ArrayStoreException</code>
zh_cn: 将 <code>{0}</code> 类型的元素存储到 <code>{1}</code> 元素的数组可能产生 <code>java.lang.ArrayStoreException</code>

source: Stream may be extended replacing {0}
zh_cn: Stream 可能会扩展的替换 {0}

source: Stretch to Bottom
zh_cn: 延伸至底

source: Stretch to Left
zh_cn: 延伸至左

source: Stretch to Right
zh_cn: 延伸至右

source: Stretch to Top
zh_cn: 延伸至顶

source: Strikeout
zh_cn: 删除线

source: String concatenation not found
zh_cn: 字符串连接没有找到

source: String literal ''{0}'' doesn''t appear to be valid property key
zh_cn: 字符串文字 ''{0}'' 不是有效的属性键

source: String literal expected
zh_cn: 期望字符串文字

source: String s = (<caret is here>
zh_cn: String s = (<插入符号放到这里>

source: String//Escape Sequence//Invalid
zh_cn: 字符串//转义序列//无效的

source: String//Escape Sequence//Valid
zh_cn: 字符串//转义序列//有效的

source: String//String text
zh_cn: 字符串//文本字符串

source: Strip trailing spaces on Save:
zh_cn: 在保存时去除尾部空格:

source: Structural Replace
zh_cn: 结构替换

source: Structural Replace Preview
zh_cn: 结构替换预览

source: Structural Search
zh_cn: 结构搜索

source: Structural Search Inspection
zh_cn: 结构搜索检查

source: Structural Search Inspection problem in template ''{0}''
zh_cn: 模板 ''{0}'' 中的结构搜索检查问题

source: Structural Search Template
zh_cn: 结构搜索模板

source: Structural Search problem: {0}
zh_cn: 结构搜索问题：{0}

source: Struts 1.1 actions
zh_cn: Struts 1.1 操作

source: Style
zh_cn: 样式

source: Submission failed
zh_cn: 提交失败

source: Submit
zh_cn: 提交

source: Submit Performance Report
zh_cn: 提交性能报告

source: Submit _Feedback...
zh_cn: 提交反馈...(_F)

source: Submit feedback to the JetBrains Web site
zh_cn: 提交反馈到 JetBrains Web 站点

source: Submitted
zh_cn: 已提交

source: Submitted as <a href="{0}">{1}</a>
zh_cn: 作为 <a href="{0}">{1}</a> 提交

source: Submitting Error Report
zh_cn: 提交错误报告

source: Subsequent steps can be fused into Stream API chain
zh_cn: 随后的步骤可以融入 Stream API 链

source: Substitution not allowed
zh_cn: 不允许替换

source: Subtypes Hierarchy
zh_cn: 子类层次结构

source: Subtypes of {0}
zh_cn: {0} 的子类型

source: Successfully created patch {0}
zh_cn: 已成功创建补丁 {0}

source: Such cyclic dependencies are not allowed.
zh_cn: 这种循环依赖是不允许的。

source: Such fields are not allowed in interfaces.
zh_cn: 这样字段在接口中是不允许的。

source: Such notes should be enclosed in triple quotes; the text inside is perceived as a string, and displayed when running the scenario step.
zh_cn: 这些注释应该用三个引号括起来;内部文本被视为一个字符串，并在运行场景步骤时显示。

source: Such sequence of targets already exists
zh_cn: 这样的目标序列已经存在

source: Suggest 'Map.ofEntries'
zh_cn: 建议 'Map.ofEntries'

source: Suggest @Nullable annotation for methods that may possibly return <code>null</code> and report nullable values passed to non-annotated parameters
zh_cn: 为可能返回 <code>null</code> 的方法建议 @Nullable ，并报告传递给未注解参数的空值

source: Suggest @Nullable annotation for methods/fields/parameters where nullable values are used
zh_cn: 当空值可用时，建议为方法/字段/参数添加 @Nullable 注解

source: Suggest package-private visibility level for class members
zh_cn: 为类成员建议 package-private（包私有） 可见性级别

source: Suggest package-private visibility level for top-level classes
zh_cn: 为顶级类建议 package-private（包私有） 可见性级别

source: Suggest to move uncommitted changes &to another changelist
zh_cn: 建议将未提交的更改到另一个更改列表(&T)

source: Suggest weaker visibility for constants
zh_cn: 建议常量的可视性更弱

source: Summary:
zh_cn: 摘要:

source: Super Method Call
zh_cn: 调用 super 方法

source: Super Methods of {0}
zh_cn: {0} 的超类方法

source: Super methods of {0}
zh_cn: {0} 的超类方法

source: Superclass
zh_cn: 超类

source: Superclass cannot be extracted from enum
zh_cn: 不能从一个枚举中提取超类

source: Superclass cannot be extracted from interface
zh_cn: 不能从一个接口中提取超类

source: Superclass:
zh_cn: 超类:

source: Supertypes Hierarchy
zh_cn: 父类层次结构

source: Supertypes of {0}
zh_cn: {0} 的超类型

source: Support paired &parens
zh_cn: 支持配对小括号(&P)

source: Support paired b&races
zh_cn: 支持配对大括号(&R)

source: Support paired bra&ckets
zh_cn: 支持配对中括号(&C)

source: Support screen readers (requires restart)
zh_cn: 支持屏幕阅读器 (需要重新启动)

source: Support string &escapes
zh_cn: 支持字符串转义(&E)

source: Suppress
zh_cn: 抑制

source: Suppress all for file
zh_cn: 抑制所有文件

source: Suppress all inspections for class
zh_cn: 为类抑制所有检查

source: Suppress for class
zh_cn: 抑制类

source: Suppress for field
zh_cn: 抑制字段

source: Suppress for file
zh_cn: 抑制文件

source: Suppress for member
zh_cn: 抑制成员

source: Suppress for method
zh_cn: 抑制方法

source: Suppress for module declaration
zh_cn: 抑制模块声明

source: Suppress for statement
zh_cn: 抑制语句

source: Suppress for tag
zh_cn: 抑制标签

source: Suppress for {0} annotated by ''{1}''
zh_cn: 以 ''{1}'' 注解抑制 {0}

source: Suppress inspection
zh_cn: 抑制检查

source: Suppress with @SuppressWarnings (for Java 5.0 only)
zh_cn: 用@SuppressWarnings 抑制(仅适用于 Java 5.0)

source: Suppressed
zh_cn: 抑制

source: Suppressing inspection ''{0}''
zh_cn: 抑制检查 ''{0}''

source: Surround With
zh_cn: 包围

source: Surround With Try / Catch
zh_cn: 用 Try / Catch 包围

source: Surround expression with
zh_cn: 包围表达式

source: Surround selected code fragment with if, while, try/catch or other construct
zh_cn: 用 if/while/try-catch 或其他结构包围选中代码片段

source: Surround statements with
zh_cn: 包围语句

source: Surround with ''if ({0} != null)''
zh_cn: 用 ''if ({0} != null)'' 包围

source: Surround with ()
zh_cn: 用 () 包围

source: Surround with <tag></tag>
zh_cn: 用 <tag></tag>包围

source: Surround with <tag></tag> in HTML/JSP
zh_cn: 在 HTML/JSP 中用 <tag></tag>包围

source: Surround with CDATA section
zh_cn: 用 CDATA 部分包围

source: Surround with Callable
zh_cn: 用 Callable 包围

source: Surround with Live Tem_plate...
zh_cn: 用代码模板包围...(_P)

source: Surround with ReadWriteLock.readLock
zh_cn: 用 ReadWriteLock.readLock 包围

source: Surround with ReadWriteLock.writeLock
zh_cn: 用 ReadWriteLock.writeLock 包围

source: Surround with if
zh_cn: 用 if 包围

source: Surround with runtime cast
zh_cn: 用运行时转换包围

source: Surround with try-with-resources block
zh_cn: 用 try-with-resources 包围

source: Surround with try/catch
zh_cn: 用 try/catch 包围

source: Surround with {}
zh_cn: 用{}包围

source: Surrounded expression is null
zh_cn: 包围的表达式为空

source: Surrounds the selection with one of the template
zh_cn: 使用一个模板包围所选内容

source: Suspend
zh_cn: 暂停

source: Suspend policy
zh_cn: 暂停政策

source: Suspend program execution and enable debugging
zh_cn: 暂停程序执行并启用调试

source: Suspend: all
zh_cn: 暂停：全部

source: Suspend: none
zh_cn: 暂停: 无

source: Suspend: thread
zh_cn: 暂停: 线程

source: Suspicious Arrays method calls
zh_cn: 可疑数组方法调用

source: Suspicious call to ''{0}''
zh_cn: ''{0}'' 的可疑调用

source: Suspicious collections method calls
zh_cn: 可疑集合方法调用

source: Suspicious comparison #ref #loc
zh_cn: 可疑性比较 #ref #loc

source: Suspicious usage of compare method
zh_cn: 比较方法的可疑用法

source: Suspicious variable/parameter name combination
zh_cn: 可疑的变量/参数名称组合

source: Swap selection boundaries
zh_cn: 交换选择的边界

source: Switch &to changelist (''{0}'')
zh_cn: 切换到更改列表 (''{0}'')(&T)

source: Switch Boot JDK...
zh_cn: 切换启动 JDK...

source: Switch Customization Scheme
zh_cn: 切换定制方案

source: Switch IDE boot JDK...
zh_cn: 切换 IDE 的启动 JDK...

source: Switch it OFF?
zh_cn: 关闭它？

source: Switch label <code>#ref</code> #loc is unreachable
zh_cn: Switch 标签 <code>#ref</code> #loc 不可达

source: Switch label<code>#ref</code> #loc is unreachable
zh_cn: switch 标签 <code>#ref</code> #loc 不可达

source: Switch to Class Hierarchy
zh_cn: 切换到类层次结构

source: Switch to HTML5 language level
zh_cn: 切换到 HTML5 语言级别

source: Switch to Subtypes Hierarchy
zh_cn: 切换到子类型层次结构

source: Switch to Supertypes Hierarchy
zh_cn: 切换到父类型层次结构

source: Switch to the bundled Java runtime, or update to version {1} or higher.
zh_cn: 切换到软件自带的 Java 运行环境，或更新到 {1} 或更高版本。

source: Switch to the next project window
zh_cn: 切换到下一个项目窗口

source: Switch to the previous project window
zh_cn: 切换到上一个项目窗口

source: Switch with {0}
zh_cn: Switch 用 {0}

source: Switch with {0} or {1}
zh_cn: Switch 用 {0} 或 {1}

source: Switched
zh_cn: 交换的

source: Switched Files
zh_cn: 已交换的文件

source: Switcher
zh_cn: 切换器

source: Synchronize ''{0}''
zh_cn: 同步 ''{0}''

source: Synchronize files after execution
zh_cn: 在执行后同步文件

source: Synchronize files on frame or editor tab activation
zh_cn: 在框架或编辑器选项卡激活时同步文件

source: Synchronize selected file
zh_cn: 同步选中文件

source: Synchronize selected files
zh_cn: 同步所选的文件

source: Synchronizing files...
zh_cn: 同步文件...

source: Synchronizing output directories...
zh_cn: 同步输出目录...

source: Syntax
zh_cn: 语法

source: Syntax Highlighting
zh_cn: 语法高亮

source: Syntax analysis
zh_cn: 语法分析

source: Syntax aware selection
zh_cn: 语法感知选择

source: Syntax printing
zh_cn: 语法印刷

source: Synthetic jsp class is referenced in method
zh_cn: 方法中引用了合成的 jsp 类

source: System Environment
zh_cn: 系统环境

source: System Error
zh_cn: 系统错误

source: System Settings
zh_cn: 系统设置

source: System-Dependent
zh_cn: 系统相关

source: TERMINATED
zh_cn: 终止

source: TODO comment
zh_cn: TODO 注释

source: TODO comment <code>#ref</code> #loc
zh_cn: TODO 注释 <code>#ref</code> #loc

source: TODO: message
zh_cn: TODO: 消息

source: T_est
zh_cn: 测试(_E)

source: T_est Subject
zh_cn: 测试对象(_E)

source: T_ype Migration...
zh_cn: 类型迁移...(_Y)

source: Tab Appearance
zh_cn: 选项卡外观

source: Tab Closing Policy
zh_cn: 选项卡关闭策略

source: Tab limit:
zh_cn: 选项卡限制:

source: Tab size:
zh_cn: tab 大小：

source: Tabs (in the editor, hierarchy views, etc.) can be closed without using the context menu.
zh_cn: 可以在不使用上下文菜单的情况下关闭选项卡(在编辑器，层次结构视图等中)。

source: Tabs Placement
zh_cn: 选项卡放置

source: Tabs and Indents
zh_cn: tab 和缩进

source: Tag
zh_cn: 标签

source: Tag Name
zh_cn: 标签名称

source: Tag Name Completion
zh_cn: 标签名称补全

source: Tag data
zh_cn: 标签数据

source: Tag name
zh_cn: 标签名称

source: Tag name expected
zh_cn: 期望标签名称

source: Tag pair
zh_cn: 标签对

source: Tag start is not closed
zh_cn: 标签开始未关闭

source: Tag tree (level {0})
zh_cn: 标签树(级别 {0})

source: Tag {0} is not allowed here
zh_cn: 此处不允许使用标签 {0}

source: Take priority over call chain wrapping
zh_cn: 优先于调用链换行

source: Takes a parameter and convers separators to '/'.
zh_cn: 获取参数并将分隔符转换为 '/' .

source: Takes an optional parameter(name) to find the parent directory
zh_cn: 使用可选参数(名称)查找父目录

source: Target
zh_cn: 目标

source: Target &destination directory:
zh_cn: 目标目录:(&D)

source: Target ''{0}'' is duplicated
zh_cn: 目标 ''{0}'' 是重复的

source: Target ''{0}'' is duplicated in file ''{1}''
zh_cn: 在文件 ''{1}'' 中，目标 ''{0}'' 是重复的

source: Target ''{0}'' is unknown
zh_cn: 目标 ''{0}'' 未知

source: Target File
zh_cn: 目标文件

source: Target JRE version ({0}) does not match project JDK version ({1}), will use sources from JDK: {2}
zh_cn: 目标 JRE 版本({0}) 不符合项目 JDK 版本({1})， 将使用源于 JDK 的：{2}

source: Target VM does not support modification watchpoints
zh_cn: 目标 VM 不支持修改观察点

source: Target VM is not paused by breakpoint request.
zh_cn: 目标 VM 不会被断点请求暂停。

source: Target class {2} has different language than {0} {1}
zh_cn: 目标类 {2} 有不同的语言比 {0}{1}

source: Target of container annotation ''{0}'' is not a subset of target of this annotation
zh_cn: 容器注解 ''{0}'' 的目标不是此注解的目标的子集

source: Target virtual machine closed connection
zh_cn: 目标虚拟机关闭连接

source: Target {0} is not accessible from {1}
zh_cn: 目标 {0} 不可以从 {1} 访问

source: Target:
zh_cn: 目标:

source: Target: {0}
zh_cn: 目标: {0}

source: Targets
zh_cn: 目标

source: Targets:
zh_cn: 目标:

source: Task:
zh_cn: 任务:

source: TearDown Method
zh_cn: TearDown 方法

source: Tells reference provider how evaluate default path for given file
zh_cn: 告诉参考提供者如何计算给定文件的默认路径

source: Tells reference provider to process only qualified class references (e.g. not resolve String as java.lang.String)
zh_cn: 告诉参考提供者只处理限定类的引用(例如，不将 String 解析为 java.lang.String)

source: Template ''{0}''
zh_cn: 模板 ''{0}''

source: Template ''{0}'' In Use
zh_cn: 使用中的模板 ''{0}''

source: Template ''{0}'' in {1}
zh_cn: {1} 中的模板 ''{0}''

source: Template ''{0}'' is used from template ''{1}''.
zh_cn: 模板 ''{0}'' 是在 ''{1}'' 中使用的。

source: Template Data Languages
zh_cn: 模板数据语言

source: Template Project Settings
zh_cn: 模板项目设置

source: Template Settings
zh_cn: 模板设置

source: Template abbreviation should contain only letters, digits, dots and hyphens.
zh_cn: 模板缩写应仅包含字母，数字，点和连字符。

source: Template language
zh_cn: 模板语言

source: Template name
zh_cn: 模板名称

source: Template preview:
zh_cn: 模板预览：

source: Template with the abbreviation "{0}" already exists in group "{1}".
zh_cn: 缩写为 "{0}" 的模板 已经存在于组 "{1}" 中。

source: Templates//Live Template
zh_cn: 模板//代码模板

source: Templates//Template variable
zh_cn: 模板//模板变量

source: Temporary configurations limit:
zh_cn: 临时配置限制:

source: Terminate
zh_cn: 终止

source: Terminate Ant process?
zh_cn: 终止 Ant 进程？

source: Terminate it?
zh_cn: 终止它？

source: Terminate process
zh_cn: 终止进程

source: Terminate the process after disconnect
zh_cn: 断开连接后终止进程

source: Terminated
zh_cn: 中止

source: Terminated: {0}
zh_cn: 终止: {0}

source: Terminating ''{0}''
zh_cn: 终止 ''{0}''

source: Ternary operation
zh_cn: 三元操作

source: Test
zh_cn: 测试

source: Test ''{0}.{1}'' ignored
zh_cn: 测试 ''{0}.{1}'' 已忽略

source: Test Class
zh_cn: 测试类

source: Test Classes
zh_cn: 测试类

source: Test Method
zh_cn: 测试方法

source: Test Results
zh_cn: 测试结果

source: Test Results - {0}
zh_cn: 测试结果 - {0}

source: Test Source Folders
zh_cn: 测试源文件夹

source: Test Sources
zh_cn: 测试源

source: Test Subjects for {0}
zh_cn: {0} 的测试对象

source: Test framework quit unexpectedly
zh_cn: 测试框架意外退出

source: Test if a node can be expanded (optional):
zh_cn: 测试一个节点是否可以扩展(可选):

source: Test ignored.
zh_cn: 测试已忽略。

source: Test method ''{0}'' doesn''t exist
zh_cn: 测试方法 ''{0}'' 不存在

source: Test output path:
zh_cn: 测试输出路径：

source: Test results export failed: {0}
zh_cn: 测试结果导出失败:{0}

source: Test runner pa&rams:
zh_cn: 测试运行参数:(&R)

source: Test-only class is referenced in production code
zh_cn: 测试专用类在生产代码中引用

source: Test-only class or method call in production code
zh_cn: 生产代码中对仅测试类或方法的调用

source: Test-only field is referenced in production code
zh_cn: 测试专用字段在生产代码中引用

source: Test-only method is called in production code
zh_cn: 测试方法在生产代码中被调用

source: Test:
zh_cn: 测试:

source: Testing &library:
zh_cn: 测试库:(&L)

source: Tests
zh_cn: 测试

source: Tests Failed
zh_cn: 测试失败

source: Tests Passed
zh_cn: 测试通过

source: Tests for {0}
zh_cn: {0} 的测试

source: Tests in ''{0}''
zh_cn: ''{0}'' 中的测试

source: Tests in Progress
zh_cn: 进行中的测试

source: Tests in Progress: Done
zh_cn: 测试进度:完成

source: Tests in Progress: Terminated
zh_cn: 测试进度:终止

source: Tests passed (with warnings)
zh_cn: 测试通过(有警告)

source: Tests were not started
zh_cn: 测试没有开始

source: Text
zh_cn: 文本

source: Text Color
zh_cn: 文本颜色

source: Text Diff
zh_cn: 文本比较

source: Text constraints
zh_cn: 文本限制

source: Text files
zh_cn: 文本文件

source: Text files and unsupported file types:
zh_cn: 文本文件和不支持的文件类型：

source: Text line
zh_cn: 文本行

source: Text to &find:
zh_cn: 查找文本:(&F)

source: Text//Background in readonly files
zh_cn: 文本//只读文件背景

source: Text//Default text
zh_cn: 文本//默认文件

source: Text//Deleted text
zh_cn: 文本//删除的文本

source: Text//Folded text
zh_cn: 文本//折叠的文本

source: Text//Folded text with highlighting
zh_cn: 高亮的文本//折叠的文本

source: Text//Readonly fragment background
zh_cn: 文本//只读片段背景

source: Text//Soft wrap sign
zh_cn: 文本//自动换行标志

source: Text//Whitespaces
zh_cn: 文本//空格

source: Text/regexp:
zh_cn: 文字/正则表达式：

source: Text:
zh_cn: 文本:

source: Thank you for evaluating {0}.<br>Your evaluation license expires in {1}<br><br>{2}
zh_cn: 谢谢评估 {0}.<br>你的评估许可证截止日期是 {1}<br><br>{2}
